td.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-11 Fri 21:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TD SIMD</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">TD SIMD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org33b4768">1. Introduction</a></li>
<li><a href="#orgd25526b">2. Travail a effectuer</a>
<ul>
<li><a href="#orgd03614c">2.1. Code</a></li>
<li><a href="#org545cd5c">2.2. Options de compilation</a></li>
</ul>
</li>
<li><a href="#org0c4506a">3. Rendu</a></li>
<li><a href="#orgc916c2e">4. References:</a></li>
</ul>
</div>
</div>
<p>
<span class="underline">Directives</span>:
</p>

<ul class="org-ul">
<li>Ce TD sera a rendre pour au plus tard Jeudi 17/12/2020 a 00:00 (minuit) aux adresses suivantes (selon qui est en charge de votre groupe): 

<ul class="org-ul">
<li><i>mohammed-salah.ibnamar@uvsq.fr</i></li>
<li><i>kevin.camus@uvsq.fr</i></li>
</ul></li>

<li>Il faudra utiliser comme sujet du courriel le format suivant (a respecter a la lettre): <b><code>[ AoB TD_simd - NOM PRENOM ]</code></b></li>
</ul>

<p>
<span class="underline">Notes</span>:
</p>

<ul class="org-ul">
<li>Vous pouvez effectuer votre exploration sur une VM car l'execution du code n'est pas importante.</li>
</ul>

<div id="outline-container-org33b4768" class="outline-2">
<h2 id="org33b4768"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
L'objectif de ce TD est d'explorer le jeu d'instructions SIMD present 
sur les processeurs x86 (Intel et AMD) dont vous disposez.
</p>

<p>
L'architecture x86 propose des instructions vectorielles/SIMD sous la forme d'extensions:
</p>

<ul class="org-ul">
<li><span class="underline"><b>SSE</b></span>: <b>Streaming SIMD Extensions</b> qui opere sur des vecteurs nommes <b>xmm?</b> (les registres disponibles vont <b>xmm0</b> a <b>xmm7</b>) qui ont une taille de <b>128bits</b> (16 octets)</li>
<li><span class="underline"><b>AVX</b></span>: <b>Advanced Vector eXtensions</b> qui opere sur des vecteurs <b>ymm?</b> (<b>ymm0</b> a <b>ymm15</b>) qui ont une taille de <b>256bits</b> (32 octets) (SandyBridge)</li>
<li><span class="underline"><b>AVX2</b></span>: <b>Advanced Vector eXtensions</b> qui opere sur des vecteurs <b>ymm?</b> (<b>ymm0</b> a <b>ymm15</b>) qui ont une taille de <b>256bits</b> (32 octets) ()</li>
<li><span class="underline"><b>AVX512</b></span>: Similaire a AVX mais avec des registres <b>zmm?</b> (<b>zmm0</b> a <b>zmm31</b>) qui ont une taille de <b>512bits</b> (64 octets) - ce jeu d'instruction n'est disponible que sur les versions serveur d'Intel</li>
</ul>
</div>
</div>

<div id="outline-container-orgd25526b" class="outline-2">
<h2 id="orgd25526b"><span class="section-number-2">2</span> Travail a effectuer</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd03614c" class="outline-3">
<h3 id="orgd03614c"><span class="section-number-3">2.1</span> Code</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Vous devez implementer plusieurs versions du code <b>dotprod</b> ci-dessous en deroulant autant de fois 
que vous desirez le corps de la boucle interne et comparer les codes assembleurs produits par le compilateur 
pour les differentes versions avec differentes options de compilation destinees a <b>produire du code assembleur vectoriel</b>.
</p>

<p>
<span class="underline">Exemple du code non deroule</span>:
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #98f5ff;">double</span> <span style="color: #daa520;">dotprod</span>(<span style="color: #98f5ff;">double</span> *<span style="color: #00bfff;">restrict</span> <span style="color: #4eee94;">a</span>, <span style="color: #98f5ff;">double</span> *<span style="color: #00bfff;">restrict</span> <span style="color: #4eee94;">b</span>, <span style="color: #98f5ff;">unsigned</span> <span style="color: #98f5ff;">long</span> <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">n</span>)
{
    <span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">d</span> = 0.0;

    <span style="color: #00bfff;">for</span> (<span style="color: #98f5ff;">unsigned</span> <span style="color: #98f5ff;">long</span> <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">i</span> = 0; i &lt; n; i++)
       d += a[i] * b[i];

    <span style="color: #00bfff;">return</span> d;
}

</pre>
</div>

<p>
<span class="underline">Exemple du code deroule 2 fois</span>:
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #98f5ff;">double</span> <span style="color: #daa520;">dotprod_unroll2</span>(<span style="color: #98f5ff;">double</span> *<span style="color: #00bfff;">restrict</span> <span style="color: #4eee94;">a</span>, <span style="color: #98f5ff;">double</span> *<span style="color: #00bfff;">restrict</span> <span style="color: #4eee94;">b</span>, <span style="color: #98f5ff;">unsigned</span> <span style="color: #98f5ff;">long</span> <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">n</span>)
{
    <span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">d1</span> = 0.0;
    <span style="color: #98f5ff;">double</span> <span style="color: #4eee94;">d2</span> = 0.0;

    <span style="color: #00bfff;">for</span> (<span style="color: #98f5ff;">unsigned</span> <span style="color: #98f5ff;">long</span> <span style="color: #98f5ff;">long</span> <span style="color: #4eee94;">i</span> = 0; i &lt; n; i += 2)
       {
          d1 += (a[i]     * b[i]);
          d2 += (a[i + 1] * b[i + 1]);
       }

    <span style="color: #00bfff;">return</span> (d1 + d2);
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org545cd5c" class="outline-3">
<h3 id="org545cd5c"><span class="section-number-3">2.2</span> Options de compilation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<span class="underline">Vous pouvez utiliser un ou plusieurs compilateurs, par exemple</span>: 
</p>

<ul class="org-ul">
<li>GNU C Compiler <b>gcc</b></li>
<li>Intel C Compiler <b>icc</b></li>
<li>LLVM <b>clang</b></li>
<li>AMD Optimizing C Compiler <b>aocc</b>.</li>
</ul>

<p>
<span class="underline">Il faudra compiler le programme en suivant les etapes suivantes (pour <b>gcc</b> et <b>clang</b>)</span>:
</p>

<ul class="org-ul">
<li><span class="underline">Version de base</span>: -O1</li>
<li><span class="underline">Version legerement optimisee</span>: -O2</li>
<li><span class="underline">Version fortement optimisee 1</span>: -O3</li>
<li><span class="underline">Version fortement optimisee 2</span>: -Ofast</li>
<li><span class="underline">Version kamikaze</span>: -march=native -mtune=native -Ofast -funroll-loops -finline-functions -ftree-vectorize</li>
</ul>

<p>
Vous pouvez utiliser d'autres options de compilation: <b>RTFM</b>.
</p>

<p>
Pour generer du code assembleur utilisez l'option: <b>-S</b> avec tous les compilateurs
</p>
</div>
</div>
</div>

<div id="outline-container-org0c4506a" class="outline-2">
<h2 id="org0c4506a"><span class="section-number-2">3</span> Rendu</h2>
<div class="outline-text-2" id="text-3">
<p>
Vous devez fournir une archive contenant les codes sources et les codes assembleurs analyses en plus d'un <b>README</b> qui fournit
des explications pour chacune des versions de la fonction et si les instructions SIMD x86 (jeux d'instructions SSE et AVX) ont ete 
utilisees de facon scalaire (i.e. add[sd] ou add[ss]) ou vectorielle (i.e. add[pd] ou add[ps]).
</p>

<ul class="org-ul">
<li>[ss | sd]: <b>ss</b> pour <b>scalar</b> <b>simple</b> precision et <b>sd</b> pour <b>scalar</b> <b>double</b> precision (operations scalaires)</li>
<li>[ps | pd]: <b>ps</b> pour <b>packed</b> <b>simple</b> precision et <b>pd</b> pour <b>packed</b> <b>double</b> precision (operations vectorielles)</li>
</ul>

<p>
Il est preferable de creer un <b>makefile</b> avec une regle par version (voir l'exemple fournit).
</p>

<p>
Il faudra aussi fournir un fichier contenant la version du compilateur utilise:
</p>

<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">Pour GCC</span>
$ gcc --version &gt; gcc_ver.txt

<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">Pour clang</span>
$ clang --version &gt; clang_ver.txt

</pre>
</div>

<p>
Et un fichier contenant les informations sur votre processeur:
</p>

<div class="org-src-container">
<pre class="src src-bash">
$ cat /proc/cpuinfo &gt; cpuinfo.txt

</pre>
</div>

<p>
Si vous decidez de faire tout le TD sur Compiler Explorer [1], vous n'avez pas besoin de fournir de <b>makefile</b>. Mais il faudra fournir les versions
des compilateurs utilises et les micro-architectures cibles [4] (-march=ARCH) et utiliser au minimum les trois compilateurs suivants: gcc, clang et icc.
</p>
</div>
</div>

<div id="outline-container-orgc916c2e" class="outline-2">
<h2 id="orgc916c2e"><span class="section-number-2">4</span> References:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>0. <span class="underline">RTFM</span> (Read The Fucking Manual): <b>man gcc</b> ou <b>man clang</b> sur la console.</li>

<li>1. <span class="underline">Compiler explorer</span>: <a href="https://gcc.godbolt.org/">https://gcc.godbolt.org/</a></li>
<li>2. <span class="underline">Intel Intrinsics Guide:</span> <a href="https://software.intel.com/sites/landingpage/IntrinsicsGuide/">https://software.intel.com/sites/landingpage/IntrinsicsGuide/</a></li>
<li>3. <span class="underline">GCC optimization options:</span> <a href="https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html">https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html</a></li>
<li>4. <span class="underline">GCC x86 architectures:</span> <a href="https://gcc.gnu.org/onlinedocs/gcc/x86-Options.html">https://gcc.gnu.org/onlinedocs/gcc/x86-Options.html</a></li>
<li>5. <span class="underline">Felix Cloutier's x86 instructions reference guide:</span> <a href="https://www.felixcloutier.com/x86/">https://www.felixcloutier.com/x86/</a></li>
<li>6. <span class="underline">Agner Fog's optimization manuals:</span> <a href="https://www.agner.org/optimize/">https://www.agner.org/optimize/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-12-11 Fri 21:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
